erpnbs/app/Models/ProductServiceCategory.php

select * from `invoices` where `invoices`.`category_id` = 18 and `invoices`.`category_id` is not null
---
    public function incomeCategoryRevenueAmount()
    {
        $year    = date('Y');
        $revenue = $this->hasMany('App\Models\Revenue', 'category_id', 'id')->where('created_by', \Auth::user()->creatorId())->whereRAW('YEAR(date) =?', [$year])->sum('amount');
        $invoices     =  $this->invoices()->with('items')->get()
        ->sum->getTotal();