erpnbs/app/Http/Controllers/LeadController.php

    public function recurrenceCheck()
    {
        $leadViews = LeadView::where('recurrence_status', 1)->get();
        $leadTasks = LeadTasks::where('recurrence_status', 1)->get();
        $dealTasks = DealTask::where('recurrence_status', 1)->get();
        $dealvisits = DealVisit::where('recurrence_status', 1)->get();
        $customerTasks = CustomerTask::where('recurrence_status', 1)->get();
        $customerVisits = CustomerVisit::where('recurrence_status', 1)->get();
---
select * from `lead_views` where `recurrence_status` = 1
select * from `lead_tasks` where `recurrence_status` = 1
select * from `deal_tasks` where `recurrence_status` = 1
select * from `deal_visits` where `recurrence_status` = 1
select * from `customer_tasks` where `recurrence_status` = 1
select * from `customer_visits` where `recurrence_status` = 1