erpnbs/app/Http/Controllers/Auth/AuthenticatedSessionController.php

select * from `users` where `email` = 'ahmnanzil33@gmail.com' limit 1
---
    public function store(LoginRequest $request)
    {

        // dd($request);
        $user = User::where('email',$request->email)->first();

update `users` set `last_login_at` = '2025-09-16 15:13:44', `users`.`updated_at` = '2025-09-16 15:13:44' where `id` = 1
---
                auth()->logout();
            }
            // Update Last Login Time
            $user->update(
                [
                    'last_login_at' => Carbon::now()->toDateTimeString(),
                ]
            );